eisup_2019_docmng_integration/src/Documents/абс_ВводЗначенийПоказателейДляРасчетаКПЭ/абс_ВводЗначенийПоказателейДляРасчетаКПЭ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ВводЗначенийПоказателейДляРасчетаКПЭ</name>
  <registerRecords>InformationRegister.абс_ЗначенияПоказателейДляРасчетаКПЭ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанныйПлан</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗагрузкиКПЭ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКорректировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПремии</name>
    <type>
      <types>EnumRef.абс_ВидыПремий</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.абс_ПоказателиДляПремий</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияПоказателей</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидАналитикиКПЭ</name>
      <type>
        <types>EnumRef.абс_ВидыАналитикиЗначенийПоказателейКПЭ</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.СотрудникиОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ЗначенияПоказателейДляРасчетаКПЭ/абс_ЗначенияПоказателейДляРасчетаКПЭ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ЗначенияПоказателейДляРасчетаКПЭ</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗначениеПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.абс_ПоказателиДляПремий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерКорректировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидАналитикиКПЭ</name>
    <type>
      <types>EnumRef.абс_ВидыАналитикиЗначенийПоказателейКПЭ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПремии</name>
    <type>
      <types>EnumRef.абс_ВидыПремий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ/абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ</name>
  <enumValues>
    <name>ПлановыеЗначения</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаПлановыхЗначений</name>
  </enumValues>
  <enumValues>
    <name>ФактическиеЗначения</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаФактическихЗначений</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_ВводЗначенийПоказателейДляРасчетаКПЭ/ManagerModule.bsl
Функция ПолучитьТаблицуПоказателейПоПлану(Ссылка) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.Показатель,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.НомерКорректировки,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.ВидАналитикиКПЭ,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.Подразделение,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.Должность,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.Сотрудник,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.ЗначениеПоказателя
	|ПОМЕСТИТЬ ВТ_ЗначенияПлана
	|ИЗ
	|	РегистрСведений.абс_ЗначенияПоказателейДляРасчетаКПЭ КАК абс_ЗначенияПоказателейДляРасчетаКПЭ
	|ГДЕ
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ.ПлановыеЗначения), ЗНАЧЕНИЕ(Перечисление.абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ.КорректировкаПлановыхЗначений))
	|	И абс_ЗначенияПоказателейДляРасчетаКПЭ.ВидПремии = &ВидПремии
	|	И абс_ЗначенияПоказателейДляРасчетаКПЭ.Показатель = &Показатель
	|	И абс_ЗначенияПоказателейДляРасчетаКПЭ.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(абс_ЗначенияПоказателейДляРасчетаКПЭ.Период, ГОД) = НАЧАЛОПЕРИОДА(&Период, ГОД)
	|
	|СГРУППИРОВАТЬ ПО
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.Показатель,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.ВидАналитикиКПЭ,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.Подразделение,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.Должность,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.Сотрудник,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.НомерКорректировки,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.ЗначениеПоказателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКорректировокПлана.Показатель,
	|	ТаблицаКорректировокПлана.ВидАналитикиКПЭ,
	|	ТаблицаКорректировокПлана.Подразделение,
	|	ТаблицаКорректировокПлана.Должность,
	|	ТаблицаКорректировокПлана.Сотрудник,
	|	ВТ_ЗначенияПлана.ЗначениеПоказателя КАК ЗначениеПоказателя
	|ПОМЕСТИТЬ ВТ_ЗначенияПланаСКорректировками
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ЗначенияПлана.Показатель КАК Показатель,
	|		МАКСИМУМ(ВТ_ЗначенияПлана.НомерКорректировки) КАК НомерКорректировки,
	|		ВТ_ЗначенияПлана.ВидАналитикиКПЭ КАК ВидАналитикиКПЭ,
	|		ВТ_ЗначенияПлана.Подразделение КАК Подразделение,
	|		ВТ_ЗначенияПлана.Должность КАК Должность,
	|		ВТ_ЗначенияПлана.Сотрудник КАК Сотрудник
	|	ИЗ
	|		ВТ_ЗначенияПлана КАК ВТ_ЗначенияПлана
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ЗначенияПлана.Должность,
	|		ВТ_ЗначенияПлана.Сотрудник,
	|		ВТ_ЗначенияПлана.Подразделение,
	|		ВТ_ЗначенияПлана.ВидАналитикиКПЭ,
	|		ВТ_ЗначенияПлана.Показатель) КАК ТаблицаКорректировокПлана
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияПлана КАК ВТ_ЗначенияПлана
	|		ПО ТаблицаКорректировокПлана.Показатель = ВТ_ЗначенияПлана.Показатель
	|			И ТаблицаКорректировокПлана.НомерКорректировки = ВТ_ЗначенияПлана.НомерКорректировки
	|			И ТаблицаКорректировокПлана.ВидАналитикиКПЭ = ВТ_ЗначенияПлана.ВидАналитикиКПЭ
	|			И ТаблицаКорректировокПлана.Подразделение = ВТ_ЗначенияПлана.Подразделение
	|			И ТаблицаКорректировокПлана.Должность = ВТ_ЗначенияПлана.Должность
	|			И ТаблицаКорректировокПлана.Сотрудник = ВТ_ЗначенияПлана.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.Показатель,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.НомерКорректировки,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.ВидАналитикиКПЭ,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.Подразделение,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.Должность,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.Сотрудник,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.ЗначениеПоказателя
	|ПОМЕСТИТЬ ВТ_ЗначенияФакта
	|ИЗ
	|	РегистрСведений.абс_ЗначенияПоказателейДляРасчетаКПЭ КАК абс_ЗначенияПоказателейДляРасчетаКПЭ
	|ГДЕ
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ.ФактическиеЗначения), ЗНАЧЕНИЕ(Перечисление.абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ.КорректировкаФактическихЗначений))
	|	И абс_ЗначенияПоказателейДляРасчетаКПЭ.ВидПремии = &ВидПремии
	|	И абс_ЗначенияПоказателейДляРасчетаКПЭ.Показатель = &Показатель
	|	И абс_ЗначенияПоказателейДляРасчетаКПЭ.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(абс_ЗначенияПоказателейДляРасчетаКПЭ.Период, ГОД) = НАЧАЛОПЕРИОДА(&Период, ГОД)
	|
	|СГРУППИРОВАТЬ ПО
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.Показатель,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.НомерКорректировки,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.ВидАналитикиКПЭ,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.Подразделение,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.Должность,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.Сотрудник,
	|	абс_ЗначенияПоказателейДляРасчетаКПЭ.ЗначениеПоказателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКорректировокФакта.Показатель,
	|	ТаблицаКорректировокФакта.ВидАналитикиКПЭ,
	|	ТаблицаКорректировокФакта.Подразделение,
	|	ТаблицаКорректировокФакта.Должность,
	|	ТаблицаКорректировокФакта.Сотрудник,
	|	ВТ_ЗначенияФакта.ЗначениеПоказателя КАК ЗначениеПоказателя
	|ПОМЕСТИТЬ ВТ_ЗначенияФактаСКорректировками
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ЗначенияФакта.Показатель КАК Показатель,
	|		МАКСИМУМ(ВТ_ЗначенияФакта.НомерКорректировки) КАК НомерКорректировки,
	|		ВТ_ЗначенияФакта.ВидАналитикиКПЭ КАК ВидАналитикиКПЭ,
	|		ВТ_ЗначенияФакта.Подразделение КАК Подразделение,
	|		ВТ_ЗначенияФакта.Должность КАК Должность,
	|		ВТ_ЗначенияФакта.Сотрудник КАК Сотрудник
	|	ИЗ
	|		ВТ_ЗначенияФакта КАК ВТ_ЗначенияФакта
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ЗначенияФакта.Должность,
	|		ВТ_ЗначенияФакта.Сотрудник,
	|		ВТ_ЗначенияФакта.Подразделение,
	|		ВТ_ЗначенияФакта.ВидАналитикиКПЭ,
	|		ВТ_ЗначенияФакта.Показатель) КАК ТаблицаКорректировокФакта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияФакта КАК ВТ_ЗначенияФакта
	|		ПО ТаблицаКорректировокФакта.Показатель = ВТ_ЗначенияФакта.Показатель
	|			И ТаблицаКорректировокФакта.НомерКорректировки = ВТ_ЗначенияФакта.НомерКорректировки
	|			И ТаблицаКорректировокФакта.ВидАналитикиКПЭ = ВТ_ЗначенияФакта.ВидАналитикиКПЭ
	|			И ТаблицаКорректировокФакта.Подразделение = ВТ_ЗначенияФакта.Подразделение
	|			И ТаблицаКорректировокФакта.Должность = ВТ_ЗначенияФакта.Должность
	|			И ТаблицаКорректировокФакта.Сотрудник = ВТ_ЗначенияФакта.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	ВТ_ЗначенияПланаСКорректировками.Показатель,
	|	ВТ_ЗначенияПланаСКорректировками.ВидАналитикиКПЭ,
	|	ВТ_ЗначенияПланаСКорректировками.Подразделение,
	|	ВТ_ЗначенияПланаСКорректировками.Должность,
	|	ВТ_ЗначенияПланаСКорректировками.Сотрудник,
	|	ЕСТЬNULL(ВТ_ЗначенияПланаСКорректировками.ЗначениеПоказателя, 0) КАК ЗначениеПоказателяПлан,
	|	ЕСТЬNULL(ВТ_ЗначенияФактаСКорректировками.ЗначениеПоказателя, 0) КАК ЗначениеПоказателяФакт
	|ИЗ
	|	ВТ_ЗначенияПланаСКорректировками КАК ВТ_ЗначенияПланаСКорректировками
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ЗначенияФактаСКорректировками КАК ВТ_ЗначенияФактаСКорректировками
	|		ПО ВТ_ЗначенияПланаСКорректировками.Показатель = ВТ_ЗначенияФактаСКорректировками.Показатель
	|			И ВТ_ЗначенияПланаСКорректировками.ВидАналитикиКПЭ = ВТ_ЗначенияФактаСКорректировками.ВидАналитикиКПЭ
	|			И ВТ_ЗначенияПланаСКорректировками.Подразделение = ВТ_ЗначенияФактаСКорректировками.Подразделение
	|			И ВТ_ЗначенияПланаСКорректировками.Должность = ВТ_ЗначенияФактаСКорректировками.Должность
	|			И ВТ_ЗначенияПланаСКорректировками.Сотрудник = ВТ_ЗначенияФактаСКорректировками.Сотрудник");
	
	Запрос.УстановитьПараметр("Период"			, Ссылка.ПериодРегистрации);
	Запрос.УстановитьПараметр("Организация"		, Ссылка.Организация);
	Запрос.УстановитьПараметр("ВидПремии"		, Ссылка.ВидПремии);
	Запрос.УстановитьПараметр("Показатель"		, Ссылка.Показатель);
	
 	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции
